# PowerFactor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalEquipmentLoadData..::..PowerFactor Property
AnalyticalEquipmentLoadData Class See Also
---
The power factor of analytical equipment load.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public double PowerFactor { get; set; }
```

Visual Basic
---
```text
Public Property PowerFactor As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double PowerFactor {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for power factor must be between 0 and 1. |

# See Also
AnalyticalEquipmentLoadData Class
Autodesk.Revit.DB.Electrical Namespace